# RbsElecPanelTotalConnectedCurrentParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsElecPanelTotalConnectedCurrentParam Property
ParameterTypeId Class See Also
---
"Total Connected Current"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsElecPanelTotalConnectedCurrentParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsElecPanelTotalConnectedCurrentParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsElecPanelTotalConnectedCurrentParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace